burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_exti.h
/* EXTI_SECCFG */
#define EXTI_SECCFG_SEC0                BIT(0)                 /*!< security configuration from line 0 */
#define EXTI_SECCFG_SEC1                BIT(1)                 /*!< security configuration from line 1 */
#define EXTI_SECCFG_SEC2                BIT(2)                 /*!< security configuration from line 2 */
#define EXTI_SECCFG_SEC3                BIT(3)                 /*!< security configuration from line 3 */
#define EXTI_SECCFG_SEC4                BIT(4)                 /*!< security configuration from line 4 */
#define EXTI_SECCFG_SEC5                BIT(5)                 /*!< security configuration from line 5 */
#define EXTI_SECCFG_SEC6                BIT(6)                 /*!< security configuration from line 6 */
#define EXTI_SECCFG_SEC7                BIT(7)                 /*!< security configuration from line 7 */
#define EXTI_SECCFG_SEC8                BIT(8)                 /*!< security configuration from line 8 */
#define EXTI_SECCFG_SEC9                BIT(9)                 /*!< security configuration from line 9 */
#define EXTI_SECCFG_SEC10               BIT(10)                /*!< security configuration from line 10 */
#define EXTI_SECCFG_SEC11               BIT(11)                /*!< security configuration from line 11 */
#define EXTI_SECCFG_SEC12               BIT(12)                /*!< security configuration from line 12 */
#define EXTI_SECCFG_SEC13               BIT(13)                /*!< security configuration from line 13 */
#define EXTI_SECCFG_SEC14               BIT(14)                /*!< security configuration from line 14 */
#define EXTI_SECCFG_SEC15               BIT(15)                /*!< security configuration from line 15 */
#define EXTI_SECCFG_SEC16               BIT(16)                /*!< security configuration from line 16 */
#define EXTI_SECCFG_SEC17               BIT(17)                /*!< security configuration from line 17 */
#define EXTI_SECCFG_SEC18               BIT(18)                /*!< security configuration from line 18 */
#define EXTI_SECCFG_SEC19               BIT(19)                /*!< security configuration from line 19 */
#if defined (GD32W515)
#define EXTI_SECCFG_SEC20               BIT(20)                /*!< security configuration from line 20 */
#endif /* defined (GD32W515) */
#define EXTI_SECCFG_SEC21               BIT(21)                /*!< security configuration from line 21 */
#define EXTI_SECCFG_SEC22               BIT(22)                /*!< security configuration from line 22 */
#define EXTI_SECCFG_SEC23               BIT(23)                /*!< security configuration from line 23 */
#define EXTI_SECCFG_SEC24               BIT(24)                /*!< security configuration from line 24 */
#define EXTI_SECCFG_SEC25               BIT(25)                /*!< security configuration from line 25 */
#define EXTI_SECCFG_SEC26               BIT(26)                /*!< security configuration from line 26 */
#define EXTI_SECCFG_SEC27               BIT(27)                /*!< security configuration from line 27 */
#define EXTI_SECCFG_SEC28               BIT(28)                /*!< security configuration from line 28 */
#if defined (GD32F5HC)
#define EXTI_SECCFG_SEC29               BIT(29)                /*!< security configuration from line 29 */
#endif /* defined (GD32F5HC) */

/* EXTI_PRIVCFG */
#define EXTI_PRIVCFG_PRIV0              BIT(0)                 /*!< privilege configuration from line 0 */
#define EXTI_PRIVCFG_PRIV1              BIT(1)                 /*!< privilege configuration from line 1 */
#define EXTI_PRIVCFG_PRIV2              BIT(2)                 /*!< privilege configuration from line 2 */
#define EXTI_PRIVCFG_PRIV3              BIT(3)                 /*!< privilege configuration from line 3 */
#define EXTI_PRIVCFG_PRIV4              BIT(4)                 /*!< privilege configuration from line 4 */
#define EXTI_PRIVCFG_PRIV5              BIT(5)                 /*!< privilege configuration from line 5 */
#define EXTI_PRIVCFG_PRIV6              BIT(6)                 /*!< privilege configuration from line 6 */
#define EXTI_PRIVCFG_PRIV7              BIT(7)                 /*!< privilege configuration from line 7 */
#define EXTI_PRIVCFG_PRIV8              BIT(8)                 /*!< privilege configuration from line 8 */
#define EXTI_PRIVCFG_PRIV9              BIT(9)                 /*!< privilege configuration from line 9 */
#define EXTI_PRIVCFG_PRIV10             BIT(10)                /*!< privilege configuration from line 10 */
#define EXTI_PRIVCFG_PRIV11             BIT(11)                /*!< privilege configuration from line 11 */
#define EXTI_PRIVCFG_PRIV12             BIT(12)                /*!< privilege configuration from line 12 */
#define EXTI_PRIVCFG_PRIV13             BIT(13)                /*!< privilege configuration from line 13 */
#define EXTI_PRIVCFG_PRIV14             BIT(14)                /*!< privilege configuration from line 14 */
#define EXTI_PRIVCFG_PRIV15             BIT(15)                /*!< privilege configuration from line 15 */
#define EXTI_PRIVCFG_PRIV16             BIT(16)                /*!< privilege configuration from line 16 */
#define EXTI_PRIVCFG_PRIV17             BIT(17)                /*!< privilege configuration from line 17 */
#define EXTI_PRIVCFG_PRIV18             BIT(18)                /*!< privilege configuration from line 18 */
#define EXTI_PRIVCFG_PRIV19             BIT(19)                /*!< privilege configuration from line 19 */
#if defined (GD32W515)
#define EXTI_PRIVCFG_PRIV20             BIT(20)                /*!< privilege configuration from line 20 */
#endif /* defined (GD32W515) */
#define EXTI_PRIVCFG_PRIV21             BIT(21)                /*!< privilege configuration from line 21 */
#define EXTI_PRIVCFG_PRIV22             BIT(22)                /*!< privilege configuration from line 22 */
#define EXTI_PRIVCFG_PRIV23             BIT(23)                /*!< privilege configuration from line 23 */
#define EXTI_PRIVCFG_PRIV24             BIT(24)                /*!< privilege configuration from line 24 */
#define EXTI_PRIVCFG_PRIV25             BIT(25)                /*!< privilege configuration from line 25 */
#define EXTI_PRIVCFG_PRIV26             BIT(26)                /*!< privilege configuration from line 26 */
#define EXTI_PRIVCFG_PRIV27             BIT(27)                /*!< privilege configuration from line 27 */
#define EXTI_PRIVCFG_PRIV28             BIT(28)                /*!< privilege configuration from line 28 */
#if defined (GD32F5HC)
#define EXTI_PRIVCFG_PRIV29             BIT(29)                /*!< privilege configuration from line 29 */
#endif /* defined (GD32F5HC) */

/* EXTI_LOCK */
#define EXTI_LOCK_LOCK                  BIT(0)                 /*!< global security and privilege configuration lock */

/* constants definitions */
/* EXTI line number */
typedef enum {
    EXTI_0      = BIT(0),                                      /*!< EXTI line 0 */
    EXTI_1      = BIT(1),                                      /*!< EXTI line 1 */
    EXTI_2      = BIT(2),                                      /*!< EXTI line 2 */
    EXTI_3      = BIT(3),                                      /*!< EXTI line 3 */
    EXTI_4      = BIT(4),                                      /*!< EXTI line 4 */
    EXTI_5      = BIT(5),                                      /*!< EXTI line 5 */
    EXTI_6      = BIT(6),                                      /*!< EXTI line 6 */
    EXTI_7      = BIT(7),                                      /*!< EXTI line 7 */
    EXTI_8      = BIT(8),                                      /*!< EXTI line 8 */
    EXTI_9      = BIT(9),                                      /*!< EXTI line 9 */
    EXTI_10     = BIT(10),                                     /*!< EXTI line 10 */
    EXTI_11     = BIT(11),                                     /*!< EXTI line 11 */
    EXTI_12     = BIT(12),                                     /*!< EXTI line 12 */
    EXTI_13     = BIT(13),                                     /*!< EXTI line 13 */
    EXTI_14     = BIT(14),                                     /*!< EXTI line 14 */
    EXTI_15     = BIT(15),                                     /*!< EXTI line 15 */
    EXTI_16     = BIT(16),                                     /*!< EXTI line 16 */
    EXTI_17     = BIT(17),                                     /*!< EXTI line 17 */
    EXTI_18     = BIT(18),                                     /*!< EXTI line 18 */
    EXTI_19     = BIT(19),                                     /*!< EXTI line 19 */
    #if defined (GD32W515)
    EXTI_20     = BIT(20),                                     /*!< EXTI line 20 */
    #endif /* defined (GD32W515) */
    EXTI_21     = BIT(21),                                     /*!< EXTI line 21 */
    EXTI_22     = BIT(22),                                     /*!< EXTI line 22 */
    EXTI_23     = BIT(23),                                     /*!< EXTI line 23 */
    EXTI_24     = BIT(24),                                     /*!< EXTI line 24 */
    EXTI_25     = BIT(25),                                     /*!< EXTI line 25 */
    EXTI_26     = BIT(26),                                     /*!< EXTI line 26 */
    EXTI_27     = BIT(27),                                     /*!< EXTI line 27 */
    EXTI_28     = BIT(28),                                     /*!< EXTI line 28 */
    #if defined (GD32F5HC)
    EXTI_29     = BIT(29)                                      /*!< EXTI line 29 */
    #endif /* defined (GD32F5HC) */
} exti_line_enum;

