burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_exti.h
/* external interrupt and event */
typedef enum {
    EXTI_INTERRUPT   = 0,                                      /*!< EXTI interrupt mode */
    EXTI_EVENT                                                 /*!< EXTI event mode */
} exti_mode_enum;

/* interrupt and event trigger mode */
typedef enum {
    EXTI_TRIG_RISING = 0,                                      /*!< EXTI rising edge trigger */
    EXTI_TRIG_FALLING,                                         /*!< EXTI falling edge trigger */
    EXTI_TRIG_BOTH,                                            /*!< EXTI rising and falling edge trigger */
    EXTI_TRIG_NONE                                             /*!< EXTI without rising edge or falling edge trigger */
} exti_trig_type_enum;

/* function declarations */
/* interrupt and event configuration functions */
/* deinitialize the EXTI, reset the value of all EXTI registers into initial values */
void exti_deinit(void);
/* initialize the EXTI, enable the configuration of EXTI initialize */
void exti_init(exti_line_enum linex, exti_mode_enum mode, exti_trig_type_enum trig_type);
/* enable the interrupts from EXTI line x */
void exti_interrupt_enable(exti_line_enum linex);
/* disable the interrupts from EXTI line x */
void exti_interrupt_disable(exti_line_enum linex);
/* enable the events from EXTI line x */
void exti_event_enable(exti_line_enum linex);
/* disable the events from EXTI line x */
void exti_event_disable(exti_line_enum linex);
/* enable EXTI software interrupt event */
void exti_software_interrupt_enable(exti_line_enum linex);
/* disable EXTI software interrupt event */
void exti_software_interrupt_disable(exti_line_enum linex);

/* security attribution and privileged access configuration functions */
/* enable the security attribution from EXTI line x */
void exti_security_enable(exti_line_enum linex);
/* disable the security attribution from EXTI line x */
void exti_security_disable(exti_line_enum linex);
/*  enable the privileged access from EXTI line x */
void exti_privilege_enable(exti_line_enum linex);
/* disable the privileged access from EXTI line x */
void exti_privilege_disable(exti_line_enum linex);
/* lock EXTI security attribution and privileged access configuration */
void exti_lock_enable(void);

/* interrupt and flag functions */
/* get EXTI line x interrupt pending flag */
FlagStatus exti_flag_get(exti_line_enum linex);
/* clear EXTI line x interrupt pending flag */
void exti_flag_clear(exti_line_enum linex);
/* get EXTI line x interrupt pending flag */
FlagStatus exti_interrupt_flag_get(exti_line_enum linex);
/* clear EXTI line x interrupt pending flag */
void exti_interrupt_flag_clear(exti_line_enum linex);

#endif /* gd32w51x_f5hc_EXTI_H */
